tap "buo/cask-upgrade"
tap "felixkratz/formulae"
tap "metadatazero/tap"
tap "nikitabobko/tap"
tap "teamookla/speedtest"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@78"
# OpenType text shaping engine
brew "harfbuzz"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Library and utilities for processing GIFs
brew "giflib"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# Color management engine supporting ICC profiles
brew "little-cms2"
# High dynamic-range image file format
brew "openexr"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Mozilla CA certificate store
brew "ca-certificates"
# GNU multiple precision arithmetic library
brew "gmp"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Portable abstraction of the hierarchical topology of modern architectures
brew "hwloc"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Asynchronous event library
brew "libevent"
# High performance message passing library
brew "open-mpi"
# Optimized BLAS library
brew "openblas"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# XML 1.0 parser
brew "expat"
# YAML Parser
brew "libyaml"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Library for command-line editing
brew "readline"
# Powerful command-line bookmark manager
brew "buku"
# Asynchronous DNS library
brew "c-ares"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# VP8/VP9 video codec
brew "libvpx"
# Audio codec
brew "opus"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Ultralightweight JSON parser in ANSI C
brew "cjson"
# Cross-platform make
brew "cmake"
# Unit testing framework for C
brew "cmocka"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU diction and style
brew "diction"
# Standard XML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Tool for managing dock items
brew "dockutil"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# HTTP/2 C Library
brew "libnghttp2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# International domain name library
brew "libidn"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# ISO AAC audio decoder
brew "faad2"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Vorbis general audio compression codec
brew "libvorbis"
# C library for files containing sampled sound
brew "libsndfile"
# Cross-platform library for audio I/O
brew "portaudio"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# Open-source formatting library for C++
brew "fmt"
# Minimalistic plugin API for video effects
brew "frei0r"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# Distributed revision control system
brew "git"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Powerful, lightweight programming language
brew "lua"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Language for typesetting graphs
brew "grap"
# Open h.265 video codec implementation
brew "libde265"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Macro processing language
brew "m4"
# Generic library support script
brew "libtool"
# Utilities for manipulating PostScript documents
brew "psutils"
# Core utilities for Python packages
brew "python-packaging"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Encoding detector library
brew "uchardet"
# GNU troff text-formatting system
brew "groff"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Post-modern modal text editor
brew "helix"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Synchronize a maildir with an IMAP server
brew "isync"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# Terminal file manager
brew "lf"
# Cross-platform Audio Library
brew "libao"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Portable Foreign Function Interface library
brew "libffi"
# X.Org: Inter-Client Exchange Library
brew "libice"
# ID3 tag manipulation library
brew "libid3tag"
# C/C++ seam carving library
brew "liblqr"
# Library for MPD in the C, C++, and Objective-C languages
brew "libmpdclient"
# C client library for NFS
brew "libnfs"
# X.Org: pthread-stubs.pc
brew "libpthread-stubs"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# Audio codec designed for speech
brew "speex"
# Open video compression format
brew "theora"
# Data and connectivity library for the Icecast server
brew "libshout"
# X.Org: X Session Management Library
brew "libsm"
# NaCl networking and cryptography library
brew "libsodium"
# High quality, one-dimensional sample-rate conversion library
brew "libsoxr"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Portable UPnP development kit
brew "libupnp"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Transcode video stabilization plugin
brew "libvidstab"
# Read binary Excel files from C/C++
brew "libxls"
# C library for creating Excel XLSX files
brew "libxlsxwriter"
# GNOME XML library
brew "libxml2"
# X.Org: X Toolkit Intrinsics library
brew "libxt"
# X.Org: X miscellaneous utility routines library
brew "libxmu"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Simple markdown translator
brew "lowdown"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Bare libuv bindings for lua
brew "luv"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Computer algebra system
brew "maxima"
# Cryptographic & SSL/TLS library
brew "mbedtls"
# Music Player Daemon
brew "mpd"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Audio metadata library
brew "taglib"
# Ncurses-based client for the Music Player Daemon
brew "ncmpcpp"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Package for scientific computing with Python
brew "numpy"
# High-level interpreted language for numerical computing
brew "octave"
# Command-line Git information tool
brew "onefetch"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl compatible regular expressions library
brew "pcre"
# Python library for creating static, animated, and interactive visualizations
brew "python-matplotlib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# QR Code generation
brew "qrencode"
# Cross-platform application and UI framework
brew "qt@5"
# Fastest and safest AV1 video encoder
brew "rav1e"
# Rsync for cloud storage
brew "rclone"
# Tools to work with human-editable, plain text data files
brew "recutils"
# Sophisticated calendar and alarm
brew "remind"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Audio time stretcher tool and library
brew "rubberband"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# Get, set, and list display resolution
brew "screenresolution"
# SMART hard drive monitoring
brew "smartmontools"
# Compression/decompression library aiming for high speed
brew "snappy"
# Secure Reliable Transport
brew "srt"
# Cross-shell prompt for astronauts
brew "starship"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Cross platform GUI for Maxima
brew "wxmaxima"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# PDF viewer
brew "xpdf"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# High-performance, asynchronous messaging library
brew "zeromq"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Remove metadata files from external drives
cask "blueharvest"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Google Chromium, sans integration with Google
cask "ungoogled-chromium"
# Desktop client for Ente Auth
cask "ente-auth"
# Web browser
cask "firefox"
# Folder comparison and synchronization software
cask "freefilesync"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Open-source video transcoder
cask "handbrake-app"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Drawing editor for creating figures in PDF format
cask "ipe"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# Password manager app
cask "keepassxc"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Free cross-platform office suite, stable version recommended for enterprises
cask "libreoffice-still"
# Web browser
cask "librewolf"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# File system integration
cask "macfuse"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Visual diff and merge tool
cask "meld"
# Remove metadata from your photos and documents
cask "metadatazero/tap/metadatazero"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# Network monitor
cask "netiquette"
# Open-source software for live streaming and screen recording
cask "obs"
# Cloud storage client
cask "onedrive"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Extracts pages, splits, merges, mixes and rotates PDF files
cask "pdfsam-basic"
# Full-screen slideshow program
cask "phoenix-slides"
# Open source virtual/remote desktop application
cask "rustdesk"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Real time file synchronisation software
cask "syncthing-app"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# LaTeX editor
cask "texmaker"
# Customizable email client
cask "thunderbird"
# Free and open-source OpenVPN client
cask "tunnelblick"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Photo viewer, image manager, image resiser and more
cask "xnviewmp"
mas "Strongbox", id: 897283731
