tap "homebrew/bundle"
tap "homebrew/core"

brew "bat"
brew "python@3.9"
brew "buku"
brew "glib"
brew "pkg-config"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "diction"
brew "dockutil"
brew "duti"
brew "exa"
brew "exiftool"
brew "fd"
brew "m4"
brew "ffmpeg"
brew "gcc"
brew "figlet"
brew "fortune"
brew "fzf"
brew "gnu-sed"
brew "gnupg"
brew "grap"
brew "groff"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lf"
brew "lynx"
brew "make"
brew "mas"
brew "mpd"
brew "ncmpcpp"
brew "neofetch"
brew "neovim"
brew "newsboat"
brew "pandoc"
brew "pass"
brew "pfetch"
brew "proselint"
brew "qt@5"
brew "r"
brew "recutils"
brew "remind"
brew "sc-im"
brew "smartmontools"
brew "speedtest-cli"
brew "starship"
brew "trash-cli"
brew "unar"
brew "wget"
brew "wifi-password"
brew "write-good"
brew "xclip"
brew "xpdf"
brew "youtube-dl"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
