adwaita-icon-theme
aom
aribb24
arpack
bat
bdw-gc
berkeley-db@5
boost
brotli
btop
buku
c-ares
ca-certificates
cairo
cjson
cmake
cmocka
coreutils
dav1d
diction
docbook
docbook-xsl
dockutil
duti
eigen
epstool
exa
exiftool
expat
faad2
fd
ffmpeg
fftw
fig2dev
flac
fltk
fluid-synth
fmt
fontconfig
freetype
frei0r
fribidi
fzf
gcc
gd
gdbm
gdk-pixbuf
gettext
ghostscript
giflib
git
gl2ps
glib
glpk
gmime
gmp
gnu-getopt
gnu-sed
gnupg
gnuplot
gnutls
gobject-introspection
gpgme
grap
graphene
graphicsmagick
graphite2
groff
gtk4
guile
harfbuzz
hdf5
helix
hicolor-icon-theme
highway
htop
hwloc
icu4c
imagemagick
imath
isl
isync
jasper
jbig2dec
jpeg
jpeg-turbo
jpeg-xl
jq
json-c
lame
leptonica
lf
libaec
libao
libarchive
libass
libassuan
libavif
libb2
libbluray
libcerf
libde265
libepoxy
libevent
libffi
libgcrypt
libgpg-error
libheif
libice
libid3tag
libidn
libidn2
libksba
liblqr
libmpc
libmpdclient
libnfs
libnghttp2
libogg
libomp
libpng
libpthread-stubs
libraw
librist
librsvg
libsamplerate
libshout
libsm
libsndfile
libsodium
libsoxr
libstfl
libtasn1
libtermkey
libtiff
libtool
libunibreak
libunistring
libupnp
libusb
libuv
libvidstab
libvmaf
libvorbis
libvpx
libvterm
libx11
libxau
libxcb
libxdmcp
libxext
libxls
libxlsxwriter
libxml2
libxmu
libxrender
libxt
libyaml
libzip
little-cms2
lmdb
lua
luajit
luajit-openresty
luv
lz4
lzo
m4
make
mas
maxima
mbedtls
metis
mpd
mpdecimal
mpfr
mpg123
msgpack
msmtp
ncmpcpp
ncurses
neofetch
neomutt
neovim
netpbm
nettle
newsboat
node
notmuch
npth
octave
onefetch
oniguruma
open-mpi
openblas
opencore-amr
openexr
openjpeg
openssl@1.1
opus
p11-kit
pandoc
pango
pcre
pcre2
pfetch
pinentry
pixman
pkg-config
plotutils
portaudio
pstoedit
psutils
pyqt@5
python@3.10
python@3.11
python@3.9
qhull
qrencode
qrupdate
qscintilla2
qt@5
rapidjson
rav1e
readline
recutils
remind
ripgrep
rlwrap
rubberband
ruby
rustup-init
sbcl
sc-im
screenresolution
sdl2
shared-mime-info
six
smartmontools
snappy
speedtest-cli
speex
sqlite
srt
starship
suite-sparse
sundials
svt-av1
taglib
talloc
task
taskwarrior-tui
tcl-tk
tesseract
texinfo
theora
tmux
tokyo-cabinet
trash-cli
tree
tree-sitter
uchardet
unar
unbound
unibilium
utf8proc
webp
wget
wifi-password
wxmaxima
wxwidgets
x264
x265
xapian
xmlto
xorgproto
xpdf
xvid
xz
yt-dlp
zeromq
zimg
zsh-autosuggestions
zsh-syntax-highlighting
zstd
adobe-acrobat-reader
alacritty
amethyst
arduino
autodesk-fusion360
brave-browser
cryptomator
eloston-chromium
exifcleaner
firefox
gimp
hiddenbar
inkscape
joplin
keepassxc
keepingyouawake
libreoffice-still
librewolf
lulu
lunar
macfuse
mactex
microsoft-auto-update
microsoft-excel
microsoft-powerpoint
microsoft-teams
microsoft-word
mpv
obsidian
onedrive
qutebrowser
signal
skim
the-unarchiver
ultimaker-cura
veracrypt
vmware-horizon-client
whatsapp
